{
  "frontmatter": {
    "title": "ANR Lab annual report",
    "description": "optimized collaborative academic writing pipeline",
    "date": "2023-08-25",
    "image": "../images/projects/anr-lab-report/main.png",
    "tags": ["Service"],
    "ongoing": true,
    "url": "and-lab-report"
  },
  "projectData": {
    "links": {
      "prod": []
    },
    "tools": [
      {
        "icon": "../images/icons/pm-muscles.png", 
        "title": "PM and service design muscles"
      },
      {
        "icon": "../images/icons/github-mark.png", 
        "title": "GitHub Actions"
      }
    ],
    "task": "To optimize the preparation process of an annual report for a network science lab so that it drives both team engagement and lab brand awareness. ",
    "whyExists": "Applied Network Research Lab of the HSE University in Moscow asked me to manage the annual report. For this, I decided to optimize the writing workflow to enable both focus on the contents (and not on the formatting) and content repurposing. To do this, I assembled a framework, set up a technical system and conducted seminars where I onboarded team members to use the system. Please, see the 'Process' section for deteailed explanation of design decisions.",
    "metaphor": "The main idea is 'separation of concerns': text, images, academic references and formatting templates are all separated from each other and then compiled according to a DIY template. Another goal is to write content once and use it both as an inner report and a website. I chose Markdown languauge for writing content, Obsidian as a text editor for its ease of use, Zotero for reference management, Pandoc for document compilation and GitHub actions for automating the final document compilation.",
    "process": [
      {
        "title": "Discussion",
        "image":"../images/projects/anr-lab-report/process-step-1.png",
        "isDone": true
      },
      {
        "title": "User flow",
        "image":"../images/projects/anr-lab-report/process-step-2.png",
        "isDone": true
      },
      {
        "title": "Prototype",
        "image":"../images/projects/anr-lab-report/process-step-3.png",
        "isDone": true
      },
      {
        "title": "Seminars",
        "image":"../images/projects/anr-lab-report/process-step-4.png",
        "isDone": true
      },
      {
        "title": "Content writing",
        "image":"../images/projects/wip.png",
        "isDone": false
      },
      {
        "title": "Website design",
        "image":"../images/projects/wip.png",
        "isDone": false
      },
      {
        "title": "Website development",
        "image":"../images/projects/wip.png",
        "isDone": false
      }      
    ],
    "details": [
      {
        "title": "Discussion",
        "text": "After ideating, I came up with a possible solution and pitched it to the team. It was not readily accepted as it required some technical know-how, but eventually we settled on this solution.",
        "images": [
          {
            "image": "../images/projects/anr-lab-report/process-step-1.png",
            "caption": "Presentation slide with Obsidian and Zotero apps"
          }
          ]
      },
      {
        "title": "User flow",
        "text": "After discussion, I built a detailed user flow of the system and shared it with the team. It required me to use the following apps and services: Obsidian, Zotero, Pandoc, GitHub and GitHub Actions. The UX of the process for the user looks like this.",
        "images": [
          {
            "image": "../images/projects/anr-lab-report/process-step-2.png",
            "caption": "The user flow of the collaborative writing pipeline"
          }
          ]
      },
      {
        "title": "Prototype",
        "text": "With a help of a lab colleague, I wrote a Continuous Integration script for GitHub Actions to automatically compile a final PDF of the report any time a team member adds new piece of text to the repository.",
        "longtext": "Now all the formatting, bibliography insertions and 'References' sections are done automatically, and team members only need to care about authoring the report in plain text.",
        "images": [
          {
            "image": "../images/projects/anr-lab-report/process-step-3.png",
            "caption": "The CI script for the GitHub Actions"
          }
          ]
      },
      {
        "title": "Seminars",
        "text": "I held several seminars for the team members with a walktrhough of the process and helped them to make their first 'commit'.",
        "longtext": "Now we are finally testing the workflow and starting to work on the contents of the report.",
        "images": [
          {
            "image": "../images/projects/anr-lab-report/process-step-4.png",
            "caption": "Zoom call with the team"
          }
          ]
      }
    ]
    }
  } 